# Pandas Basics

DataFrames allow you to store and manipulate tabular data in rows of observations and columns of variables.

### Lists in Python :

- Collection of items of different data types.
- Enclosed in square bracker [].
- Seperated by commas.

In [48]:
# List 
num_list = [1, 2, 3, 4]
print(num_list)
mix_list = [1, "Jerry", "Science", 79.5, True]
print(mix_list)

[1, 2, 3, 4]
[1, 'Jerry', 'Science', 79.5, True]

### Access elements of a list

In [49]:
mix_list = [1, "Jerry", "Science", 79.5, True]
print(mix_list[0])
print(mix_list[:3])
# modify elements 
mix_list[2] = "Computer"
print(mix_list)

1
[1, 'Jerry', 'Science']
[1, 'Jerry', 'Computer', 79.5, True]

### Adding, removing and sorting elements

In [50]:
# adding 
sub_list = ["Python", "Perl", "Java", "C++"]
sub_list.insert(2, "R")
print(sub_list)
# removing
sub_list.remove("Java")
print(sub_list)
# sorting 
sub_list.sort()
print(sub_list)

['Python', 'Perl', 'R', 'Java', 'C++']
['Python', 'Perl', 'R', 'C++']
['C++', 'Perl', 'Python', 'R']

### Operations on a list

In [51]:
# find length of a list
sub_list = ["Python", "Perl", "Java", "C++"]
num_list = [1, 3, 4, 5]
print(len(sub_list))
# max in a list - for homogenous list 
print(max(sub_list))
print(max(num_list))

4
Python
5

In [52]:
# append - it adds the element at the end of the list  
num_list.append(6)
print(num_list)
#pop - Removes and returns the last object in the list.
num_list.pop()
print(num_list)
#reverse - reverses the order of list 
num_list.reverse()
print(num_list)

[1, 3, 4, 5, 6]
[1, 3, 4, 5]
[5, 4, 3, 1]

### Some more operations

In [53]:
# concate
num_list1 = [1, 3, 4, 5]
num_list2 = [5, 6, 7]
print(num_list1 + num_list2)

[1, 3, 4, 5, 5, 6, 7]

In [54]:
# repeating the list n times 
new_list = num_list1*2
print(new_list)
# boolean : checking if a number is present in a list 
print(4 in new_list)
## boolean : checking if a number is not present in a list
print(4 not in new_list)

[1, 3, 4, 5, 1, 3, 4, 5]
True
False

## Pandas

The primary two components of pandas are the Series and DataFrame. A Series is essentially a column, and a DataFrame is a multi-dimensional table made up of a collection of Series.

In [55]:
# import pandas 
import pandas as pd
import numpy as np

In [56]:
# creating series
s1 = pd.Series(["Jenny", "Ravi", "John", "Harry"])
print(s1)
s2 = pd.Series([99, 83, 85, 76])
print(s2)

0    Jenny
1     Ravi
2     John
3    Harry
dtype: object
0    99
1    83
2    85
3    76
dtype: int64

## Creating/Reading data

From series

In [57]:
# create data from series
s3 = pd.Series([90, 95, 88, 79])
frame = {"Name": s1, "Math_score": s2, "Science_score":s3}
print(frame["Name"])
df_sub = pd.DataFrame(frame)
df_sub.head()

0    Jenny
1     Ravi
2     John
3    Harry
dtype: object

    Name  Math_score  Science_score
0  Jenny          99             90
1   Ravi          83             95
2   John          85             88
3  Harry          76             79

### Reading csv

In [58]:
df = pd.read_csv(
    "https://raw.githubusercontent.com/plotly/datasets/master/fips-unemp-16.csv",
    dtype = {"fips": str}
)
print(df.head())

    fips  unemp
0  01001    5.3
1  01003    5.4
2  01005    8.6
3  01007    6.6
4  01009    5.5

In [59]:
# df = pd.read_csv("countries_data.csv", index_col = 0)
# df.head()

### Reading xlsx

In [60]:
# Essentially a stored Python dict
# xlsx = pd.ExcelFile('PATH\FileName.xlsx')
# sheet1 = xlsx.parse(0)
# print(sheet1.head())
# print(sheet1.tail())

### Data summary

In [61]:
# summary numeric data 
print(df_sub.describe(include = "all"))

         Name  Math_score  Science_score
count       4    4.000000       4.000000
unique      4         NaN            NaN
top     Harry         NaN            NaN
freq        1         NaN            NaN
mean      NaN   85.750000      88.000000
std       NaN    9.639329       6.683313
min       NaN   76.000000      79.000000
25%       NaN   81.250000      85.750000
50%       NaN   84.000000      89.000000
75%       NaN   88.500000      91.250000
max       NaN   99.000000      95.000000

In [62]:
print(df_sub.info())
print(df_sub.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           4 non-null      object
 1   Math_score     4 non-null      int64
 2   Science_score  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes
None
(4, 3)

### Data Selection

In [63]:
# selecting a column
print(df_sub["Name"])
# selecting top 3 rows 
df_sub[:3]

0    Jenny
1     Ravi
2     John
3    Harry
Name: Name, dtype: object

    Name  Math_score  Science_score
0  Jenny          99             90
1   Ravi          83             95
2   John          85             88

### Selection by label - .loc

In [64]:
print(df_sub.loc[:, "Name"])
print(df_sub.loc[:2, ["Name", "Science_score"]])

0    Jenny
1     Ravi
2     John
3    Harry
Name: Name, dtype: object
    Name  Science_score
0  Jenny             90
1   Ravi             95
2   John             88

### Selection by position - .iloc

In [65]:
print(df_sub.iloc[:, :2])
print(df_sub.iloc[:2, :3])

    Name  Math_score
0  Jenny          99
1   Ravi          83
2   John          85
3  Harry          76
    Name  Math_score  Science_score
0  Jenny          99             90
1   Ravi          83             95

### Setting and filtering values

In [66]:
df_sub.loc[df_sub["Name"] == "Jenny", "Name"] = "Jerry"
print(df_sub)
df_sub.iloc[0, 0] = "Jerry"
print(df_sub)

    Name  Math_score  Science_score
0  Jerry          99             90
1   Ravi          83             95
2   John          85             88
3  Harry          76             79
    Name  Math_score  Science_score
0  Jerry          99             90
1   Ravi          83             95
2   John          85             88
3  Harry          76             79

In [67]:
print(df_sub.loc[df_sub["Science_score"] >= 90, ["Name", "Science_score"]])

    Name  Science_score
0  Jerry             90
1   Ravi             95

### Missing value treatment

In [68]:
df_sub.iloc[0, 2] = np.nan
print(df_sub)

    Name  Math_score  Science_score
0  Jerry          99            NaN
1   Ravi          83           95.0
2   John          85           88.0
3  Harry          76           79.0

In [69]:
df_sub.dropna(how = "any") # To drop any rows that have missing data.

    Name  Math_score  Science_score
1   Ravi          83           95.0
2   John          85           88.0
3  Harry          76           79.0

In [70]:
# substitute missing value with mean
mean_score = np.mean(df_sub["Science_score"])
df_sub.fillna(value = mean_score)

    Name  Math_score  Science_score
0  Jerry          99      87.333333
1   Ravi          83      95.000000
2   John          85      88.000000
3  Harry          76      79.000000

### Merging dataframe

In [71]:
# Concat 
new_df = pd.DataFrame({
    "Name": ["Rachel"],
    "Math_score": [95],
    "Science_score": [98]
})
new_df

     Name  Math_score  Science_score
0  Rachel          95             98

In [72]:
# concat
df_concat = pd.concat([df_sub, new_df])
df_concat.reset_index(inplace = True)
df_concat.drop(columns = ["index"], inplace = True)
df_concat

     Name  Math_score  Science_score
0   Jerry          99            NaN
1    Ravi          83           95.0
2    John          85           88.0
3   Harry          76           79.0
4  Rachel          95           98.0

In [73]:
# Join
s1 = ["Jerry", "Ravi", "John", "Harry", "Rachel"]
s2 = ["A", "B", "A", "B", "A"]
df_last_name = pd.DataFrame({
    "Name": s1,
    "Section": s2
})
df_last_name
df_merge = pd.merge(df_concat, df_last_name, on = "Name", how = "inner")
df_merge

     Name  Math_score  Science_score Section
0   Jerry          99            NaN       A
1    Ravi          83           95.0       B
2    John          85           88.0       A
3   Harry          76           79.0       B
4  Rachel          95           98.0       A

### Grouping data

In [79]:
# average score in Mathemetics per section 
print(df_merge.groupby(["Section"])["Math_score"].mean())
print(df_merge.groupby(["Section"])["Name"].count())

Section
A    93.0
B    79.5
Name: Math_score, dtype: float64
Section
A    3
B    2
Name: Name, dtype: int64

### Loops in pandas

In [75]:
for index, row in df_merge.iterrows():
    print(index) # index of the df
    print(row["Name"])
    print(df_merge.loc[index, "Math_score"])

0
Jerry
99
1
Ravi
83
2
John
85
3
Harry
76
4
Rachel
95

### Functions in pandas

In [76]:
# initialized using def 
def rating_function(x):
    if x >= 80:
        return "good"
    elif (x < 80) & (x > 60):
        return "descent"
    else :
        return "bad"

In [77]:
# rating_function(df_merge['Math_score'])
for index, row in df_merge.iterrows():
    df_merge.loc[index, "Math_grade"] = rating_function(row["Math_score"])    
df_merge

     Name  Math_score  Science_score Section Math_grade
0   Jerry          99            NaN       A       good
1    Ravi          83           95.0       B       good
2    John          85           88.0       A       good
3   Harry          76           79.0       B    descent
4  Rachel          95           98.0       A       good

In [78]:
# Apply fn 
df_merge["Math_grade"] = df_merge["Math_score"].apply(rating_function)
df_merge

     Name  Math_score  Science_score Section Math_grade
0   Jerry          99            NaN       A       good
1    Ravi          83           95.0       B       good
2    John          85           88.0       A       good
3   Harry          76           79.0       B    descent
4  Rachel          95           98.0       A       good